dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
/*
* Outputs:
* PA2 - Digit 0
* PA1 - Digit 1
* PA0 - Digit 2
* PB2,PB1 - a
* PC6,PC7 - b
* PC4,PA7 - c
* PA4,PF5 - d
* PF4, PA3 - e
* PB11,PB10 - f
* PB0,PC5 - g
* PA6,PA5 - DP
*
*
* A
* F B
* G
* E C
* D
* DP
*/

/**
 * @brief  Main program.
 * @param  None
 * @retval None
 */
int main(void)
{

	init();

	if (SysTick_Config(SystemCoreClock / (1000))){
			while(1); // Capture error
		}
		NVIC_SetPriority (SysTick_IRQn, 3);

	/*
	 * commads:
	 * 0 - status 0-free, 1-Working, 2-COOLING, 3-WAITING
	 * 1 - start
	 * 2 - set pre-time
	 * 3 - set cool-time
	 * 4 - stop - may be not implemented in some controllers
	 * 5 - set main time
	 */

	digits[0] = 0;
	digits[1] = 1;
	digits[2] = 2;
	prev_status = 0;
	state = state_show_time;
	pre_time = 0;
	main_time = 0;
	cool_time = 0;
	read_eeprom();
	if(!preset_pre_time || ! preset_cool_time){
		preset_pre_time = 7;
		preset_cool_time = 3;
		write_eeprom();
	}
	GPIOA->BSRR = GPIO_BSRR_BS_0 | GPIO_BSRR_BS_1 | GPIO_BSRR_BS_2;
	update_status();
	while (1)
	{

		int delay_counter = 0;
//		IWDG_ReloadCounter();
//		for (delay_counter = 0; delay_counter<500; delay_counter++);


		ProcessButtons();
		if(pre_time || main_time || cool_time) state = state_show_time; // Working now. Other functions disabled
		switch (state){
		case state_show_time:
		case state_set_time:
			if(!pre_time && ! main_time && !cool_time ){
				flash_mode = 0;
				state = state_set_time;
				display_data = ToBCD(time_to_set);
//				display_data = ToBCD(last_button);
			} else {
				state = state_show_time;
				//				  time_to_set = 0;
				display_data = ToBCD(main_time);
//				display_data = ToBCD(last_button);
			}
			break;
		case state_show_hours:

			if( flash_mode != 3){
				flash_mode = 3; // All flashing
			}
			{
				int index = (flash_counter/8)%4;
				if(index<3){
					display_data =  ToBCD(work_hours[index]);
				}
				else {
					display_data = 0x0FF;
				}
			}
			break;
		case state_enter_service:
			display_data = service_mode|0xF0;
			flash_mode = 0;
			break;

		case state_clear_hours:
			flash_mode = 3;
			display_data = 0x00C;
			break;
		case state_address:
			flash_mode = 0;
			display_data = 0xA;
			break;
		case state_pre_time:
			flash_mode = 2;
			display_data = 0x3 | preset_pre_time;;
			break;
		case state_cool_time:
			flash_mode = 2;
			display_data = 0x4 | preset_cool_time;
			break;
		case state_ext_mode:
			flash_mode = 0;
			display_data = 0x5;
			break;
		}
//		show_digit(display_data);
		if (state == state_show_time){
			if(!pre_time && main_time){
				// turn on lamps
//				set_lamps(100);
//				set_licevi_lamps(100);
//				set_fan1(20);
//				set_fan2(100);
			} else	if(!pre_time && !main_time && cool_time){
//				set_lamps(0);
//				set_licevi_lamps(0);
//				set_fan1(100);
//				set_fan2(100);
				// turn on all coolers
			} else {
				// turn off all
				set_lamps(0);
				set_licevi_lamps(0);
				set_fan1(0);
				set_fan2(0);
				set_clima(0);
				state = state_set_time;
			}
		}
//
//		while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET); // wAIT UNTIL RX BUFFER IS EMPTY
//		int data =  USART_ReceiveData(USART1);
//		USART_SendData(USART1,0x80);
//				while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY


	}
}


void TIM3_IRQHandler() {
	if((TIM2->SR & TIM_SR_UIF) != 0) // If update flag is set
	{
		TIM2->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
		if(TIM_ICInitStructure.TIM_ICPolarity == TIM_ICPolarity_Rising)
			TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Falling;
		else TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
		TIM_ICInit(TIM2, &TIM_ICInitStructure);
	}
	zero_crossed = 1;

}

int ToBCD(int value){
	int digits[3];
	int result;
	digits[0] = value %10;
	digits[1] = (value/10) % 10;
	digits[2] = (value/100) % 10;
	result = digits[0] | (digits[1]<<4) | (digits[2]<<8);
	return result;
}

int FromBCD(int value){
	int digits[3];
	int result;
	digits[0] = value & 0x0F;
	digits[1] = (value>>4) & 0x0F;
	digits[2] = (value>>8) & 0x0F;
	result = digits[0] + digits[1]*10 + digits[2]*100;
	return result;
}


/**
 * @brief  Manage the activity on buttons
 * @param  None
 * @retval None
 */
void ProcessButtons(void)
{

	if (last_button < 0x1f){
		if(last_button != prev_button){
			switch(last_button){
			case BUTTON_START:
				if( pre_time ){
					//send_start();
					Gv_miliseconds = 0;
					pre_time = 0;
					state = state_show_time;
					update_status();
				}
				if(!pre_time && ! main_time && !cool_time) {
					if(time_to_set){
						// Send of time moved elsewhere
						pre_time = preset_pre_time;
						main_time = time_to_set;
						cool_time = preset_cool_time;
						state = state_show_time;
						time_to_set = 0;
						Gv_miliseconds = 0;
						update_status();
					} else {
						if (state > state_enter_service){
							// Write EEPROM
							if(state == state_clear_hours){
								work_hours[0] = 0;
								work_hours[1] = 0;
								work_hours[2] = 0;
							}
							write_eeprom();
							read_eeprom();
							start_counter = 0;
							service_mode = mode_null;
						} else {
							start_counter = START_COUNTER_TIME;
						}
						state = state_show_hours;
					}
				}


				break;
			case BUTTON_FAN1:
				selected_led_bits &= ~(LED_BUTTONS_MASK ^ LED_FAN1_L);
				selected_led_bits ^= LED_FAN1_L;
				auto_exit_fn = 20;
				break;
			case BUTTON_FAN2:
//				selected_led_bits &=  ~(LED_BUTTONS_MASK ^ LED_FAN2_L);
//				selected_led_bits ^= LED_FAN2_L;
				auto_exit_fn = 20;
				break;
			case BUTTON_LICEVI:
				if(minute_counter){
					selected_led_bits &=  ~(LED_BUTTONS_MASK ^ LED_LICEVI_L);
					selected_led_bits ^= LED_LICEVI_L;
				}
				auto_exit_fn = 20;
				break;
			case BUTTON_CLIMA:
				selected_led_bits &=  ~(LED_BUTTONS_MASK ^ LED_CLIMA_L);
				selected_led_bits ^= LED_CLIMA_L;
				auto_exit_fn = 20;
				break;
			case BUTTON_PLUS:
			{
				//				if(  led_bits){
				//					led_bits = led_bits <<1;
				//				} else {
				//					led_bits = 0x01;
				//				}
				auto_exit_fn = 20;

				if(state == state_show_hours) {
					state = state_set_time;
					start_counter = 0;
				}
				if(state == state_set_time){
					if(time_to_set < 25){
						if(!Gv_UART_Timeout)
							time_to_set ++;
						//			if((time_to_set & 0x0F)>9) time_to_set +=6;
					}
				}
				else if(state > state_enter_service){
					start_counter = EXIT_SERVICE_TIME;
					switch (service_mode){
					case mode_set_address:
						break;
					case mode_set_pre_time:
						if(preset_pre_time<9) preset_pre_time++;
						break;
					case mode_set_cool_time:
						if(preset_cool_time<9) preset_cool_time++;
						break;
					default:
						break;
					}
				} else {
					if(selected_led_bits & LED_FAN2_L){
						if(percent_fan2<100) percent_fan2=100;
						set_fan2(percent_fan2);
					} else if(selected_led_bits & LED_FAN1_L){
						if(percent_fan1<100) percent_fan1+=25;
						set_fan1(percent_fan1);
					} else if(selected_led_bits & LED_CLIMA_L){
						if(percent_clima<100) percent_clima=100;
						set_clima(percent_clima);
					}
				}




