dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
			}
			break;
			case BUTTON_MINUS:
				//				if(  led_bits){
				//					led_bits = led_bits >>1;
				//				} else {
				//					led_bits = 0x01 << 31;
				//				}
				auto_exit_fn = 20;

				if(state == state_show_hours) {
					state = state_set_time;
					start_counter = 0;
				}
				if(state == state_set_time){
					if(time_to_set) {
						if(!Gv_UART_Timeout) time_to_set--;
					}
				}else if(state > state_enter_service){
					start_counter = EXIT_SERVICE_TIME;
					switch (service_mode){
					case mode_set_address:
						break;
					case mode_set_pre_time:
						if(preset_pre_time) preset_pre_time--;
						break;
					case mode_set_cool_time:
						if(preset_cool_time) preset_cool_time--;
						break;
					default:
						break;
					}
				}
				if(selected_led_bits & LED_FAN2_L){
					if(percent_fan2) percent_fan2 = 0;
					set_fan2(percent_fan2);
				} else if(selected_led_bits & LED_FAN1_L){
					if(percent_fan1) percent_fan1-=25;
					set_fan1(percent_fan1);
				}
				else if(selected_led_bits & LED_LICEVI_L){
					if(percent_licevi) percent_licevi=0;
					set_licevi_lamps(percent_licevi);
					update_status();
				}

				break;
			default:
				while(0);
			}
			prev_button =  last_button;
		}
	} else {
		prev_button = last_button;
	}


	if (last_button == BUTTON_START)
	{
		// LED1_ON;
		if(start_counter< (START_COUNTER_TIME+ ENTER_SERVICE_DELAY + 6*SERVICE_NEXT_DELAY)) start_counter++;
		if(start_counter== START_COUNTER_TIME + ENTER_SERVICE_DELAY){
			if(curr_status == STATUS_FREE &&(state < state_enter_service))
			{
				state = state_enter_service;
				service_mode = mode_clear_hours; // Clear Hours
			}
		}
		if(state == state_enter_service){
			if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 1*SERVICE_NEXT_DELAY){
				service_mode = mode_set_address; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 2*SERVICE_NEXT_DELAY){
				service_mode = mode_set_pre_time; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 3*SERVICE_NEXT_DELAY){
				service_mode = mode_set_cool_time; //
			}
		}
		if(time_to_set && state == state_set_time && start_counter == START_DELAY){
			// Do start
			state = state_show_time;
//			send_time();
			//			start_counter = 0;
		}
		if(curr_status == STATUS_WAITING && start_counter == START_DELAY){
			// Cancel start
			state = state_show_time;
			time_to_set = 0;
			preset_pre_time = 0;
			preset_cool_time = 0;
//			send_time();
			read_eeprom();
			//			start_counter = 0;

		}
	}
	else
	{
		if(start_counter){
			if(state == state_show_hours){
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else if(state >= state_enter_service){
				if(state == state_enter_service){
					state = service_mode + state_enter_service;
				}
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else {
				start_counter = 0;

			}
		}
		if(prev_status != curr_status){
			if (prev_status == STATUS_WAITING && curr_status == STATUS_WORKING){
				work_hours[2]+=time_to_set;
				if(work_hours[2]>59){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
				time_to_set = 0;
				percent_clima = 0, percent_licevi = 100, percent_fan1 = 0, percent_fan2 = 100;
				zero_crossed = 0;
				set_lamps(100);
				set_licevi_lamps(percent_licevi);
				set_fan1(percent_fan1);
				set_fan2(percent_fan2);
				set_clima(percent_clima);
			}
			if (curr_status == STATUS_COOLING){
				selected_led_bits = 0;
				percent_licevi = 0, percent_fan1 = 100, percent_fan2 = 100;
				set_lamps(0);
				set_licevi_lamps(percent_licevi);
				set_fan1(percent_fan1);
				set_fan2(percent_fan2);
				set_clima(percent_clima);
			}
			if (curr_status == STATUS_FREE){
				percent_clima = 0, percent_licevi = 0, percent_fan1 = 0, percent_fan2 = 0;
				set_lamps(0);
				set_licevi_lamps(percent_licevi);
				set_fan1(percent_fan1);
				set_fan2(percent_fan2);
				set_clima(percent_clima);
				selected_led_bits = 0;
				minute_counter = 0;
			}
			prev_status = curr_status;

		}
		//    LED1_OFF;
	}
}



/**
 * @brief  Add a delay using the Systick
 * @param  nTime Delay in milliseconds.
 * @retval None
 */
void SystickDelay(__IO uint32_t nTime)
{

	Gv_SystickCounter = nTime;
	while (Gv_SystickCounter != 0)
	{
		// The Gv_SystickCounter variable is decremented every ms by the Systick interrupt routine
	}

}

void update_status(void){
	if(pre_time) {
		curr_time = pre_time;
		curr_status = STATUS_WAITING;
	}
	else if(main_time) {
		curr_time = main_time;
		curr_status = STATUS_WORKING;
		led_bits |= LED_CLIMA_L | LED_FAN1_L | LED_FAN2_L | LED_UNUSED_BUTTON_MASK;
		if(percent_licevi) led_bits |= LED_LICEVI_L;
		else {
			selected_led_bits &= ~LED_LICEVI_L;
			led_bits &= ~LED_LICEVI_L;
		}
	}
	else if(cool_time) {
		curr_time = cool_time;
		curr_status = STATUS_COOLING;
	}
	else {
		curr_time = 0;
		curr_status = STATUS_FREE;
		led_bits = 0;
	}
}
void TimingDelay_Decrement(void)
{
	if (Gv_SystickCounter != 0x00)
	{
		Gv_SystickCounter--;
	}
	if( ++ refresh_counter>200){
		refresh_counter = 0;
		flash_counter++;
		if(auto_exit_fn)
		{
			auto_exit_fn--;
			if (!auto_exit_fn) selected_led_bits =0;
		}
	}
	if(Gv_miliseconds++>60000){
		Gv_miliseconds = 0;
		if (pre_time)pre_time--;
		else if (main_time) {
			main_time--;
			minute_counter ++;
		}
		else if (cool_time) cool_time--;
		update_status();
	}
	if  (Gv_UART_Timeout){
		 Gv_UART_Timeout--;
		 if(! Gv_UART_Timeout) {
			 rx_state = 0;
			 pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;
		 }
	}
	if(++led_counter>6){
		led_counter = 0;
		digit_num++;
		flash_counter++;
		display_data = 0xdef; //DEBUG!!!!1
		if(digit_num>4) digit_num = 0;
		GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2; // Turn off the lights while changing them
		show_digit(((display_data & 0xFFF)& (0x0F<<(digit_num*4)))>>(digit_num*4));
		if(flash_mode < 3 ||(flash_counter & 0x40)){
			switch (digit_num){
			case 0:
				GPIOA->BSRR = GPIO_BSRR_BS_2 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1;
				break;

			case 1:
				GPIOA->BSRR = GPIO_BSRR_BS_1 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_2;
				break;
			case 2:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				GPIOA->BSRR = GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2;
				//set Aqua 2 LEDs

				break;
			case 3:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				GPIOA->BSRR = GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2;
				//set Aqua 1 LEDs
				if(aqua_fresh_level>0){

				} else {

