dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
				}
				break;
			case 2:
			default:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				GPIOA->BSRR = GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2;
				break;
			}
		}
		if (((flash_mode == 1)&& digit_num == 0 && (flash_counter & 0x40)) || ((flash_mode == 2) && (digit_num == 2))){
			GPIOA->BSRR = GPIO_BSRR_BS_6 | GPIO_BSRR_BS_5;
		}
	}
	IWDG_ReloadCounter(); //DEBUG


}


void read_eeprom(void){
	int index = 0;
	flash_struct *flash_mem;
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<512))index+=2;
	if(index == 0){
		// Load defaults
		flash_mem = 0;
		preset_pre_time = 7;
		preset_cool_time = 3;
		work_hours[0] = 0;
		work_hours[1] = 0;
		work_hours[2] = 0;
		return;
	}
	index-=2;
	flash_mem = (flash_struct*)&eeprom_array[index];
	preset_pre_time = flash_mem->settings.pre_time ;
	preset_cool_time = flash_mem->settings.cool_time;
	work_hours[0] = flash_mem->time.hours_h;
	work_hours[1] = flash_mem->time.hours_l;
	work_hours[2] = flash_mem->time.minutes;
}

void write_eeprom(void){
	int index = 0;
	FLASH_Unlock();
	volatile flash_struct flash_mem;
	uint32_t *p = (uint32_t *)&flash_mem;
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<512))index+=2;
	if(index == 512){
		// No more room. Erase the 4 pages
		FLASH_ErasePage((uint32_t)&eeprom_array[0]);
		FLASH_ErasePage((uint32_t)&eeprom_array[128]);
		FLASH_ErasePage((uint32_t)&eeprom_array[256]);
		FLASH_ErasePage((uint32_t)&eeprom_array[384]);
		index = 0;
	}

	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<512))index++;
	if(index == 512){
		display_data = 0xE01;
		for (index = 0; index<20; index++){
		}
	} else {

		flash_mem.settings.pre_time = preset_pre_time;
		flash_mem.settings.cool_time = preset_cool_time;
		flash_mem.settings.addresse = controller_address;
		flash_mem.settings.unused = 0x55;
		flash_mem.time.hours_h = work_hours[0];
		flash_mem.time.hours_l = work_hours[1];
		flash_mem.time.minutes = work_hours[2];
		flash_mem.time.used_flag = 0;
		FLASH_ProgramWord((uint32_t)&eeprom_array[index],p[0]);
		FLASH_ProgramWord((uint32_t)&eeprom_array[index+1],p[1]);
		index = sizeof(flash_mem);
		index ++;
	}
	//	FLASH_Lock();
}
void set_lamps(int value){
	while(!zero_crossed);
	if (value)	GPIOB->BSRR = GPIO_BSRR_BS_13;
	else GPIOB->BRR = GPIO_BSRR_BS_13;
}
void set_licevi_lamps(int value){
	while(!zero_crossed);
	if (value)	GPIOB->BSRR = GPIO_BSRR_BS_14;
	else GPIOB->BRR = GPIO_BSRR_BS_14;
}
void set_fan2(int value){
	while(!zero_crossed);
	if(value) led_bits |= LED_FAN2_1 | LED_FAN2_2 | LED_FAN2_3 | LED_FAN2_4;
	else led_bits &= ~(LED_FAN2_1 | LED_FAN2_2 | LED_FAN2_3 | LED_FAN2_4);
	if (value)	GPIOA->BSRR = GPIO_BSRR_BS_10;
	else GPIOA->BRR = GPIO_BSRR_BS_10;
}
void set_fan1(int value){
	uint32_t tim_base=5;
	TIM_Cmd(TIM2, DISABLE);
	led_bits &= ~(LED_FAN1_1 | LED_FAN1_2 | LED_FAN1_3 | LED_FAN1_4 );
	if(value > 75 ) led_bits |= (LED_FAN1_1 | LED_FAN1_2 | LED_FAN1_3 | LED_FAN1_4 );
	if(value > 50 ) led_bits |= (LED_FAN1_1 | LED_FAN1_2 | LED_FAN1_3 );
	if(value > 25 ) led_bits |= (LED_FAN1_1 | LED_FAN1_2 );
	if(value > 0  ) led_bits |= (LED_FAN1_1  );

	if (value == 100) tim_base = 5;
	if (value == 75) tim_base = 40;
	if (value == 50) tim_base = 49;
	if (value == 25) tim_base = 58;
	TIM_TimeBaseStructure.TIM_Period = tim_base;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

	/* TIM2 PWM2 Mode configuration: Channel4 */
	//for one pulse mode set PWM2, output enable, pulse (1/(t_wanted=TIM_period-TIM_Pulse)), set polarity high
	if (value)	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	else 	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Disable;
	if (TIM_TimeBaseStructure.TIM_Period) TIM_OCInitStructure.TIM_Pulse = TIM_TimeBaseStructure.TIM_Period-5;
	else  TIM_OCInitStructure.TIM_Pulse = 9;

	TIM_OC4Init(TIM2, &TIM_OCInitStructure);
	TIM_Cmd(TIM2, ENABLE);

}
void set_clima(int value){
	led_bits &= ~(LED_CLIMA_1 | LED_CLIMA_2 | LED_CLIMA_3 | LED_CLIMA_4 );
	if(value ) led_bits |= (LED_CLIMA_1 | LED_CLIMA_2 | LED_CLIMA_3 | LED_CLIMA_4 );
	if (value)	GPIOA->BSRR = GPIO_BSRR_BS_11;
	else GPIOA->BRR = GPIO_BSRR_BS_11;
}

void usart_receive(void){

	enum rxstates {state_none, state_pre_time, state_main_time, state_cool_time, state_get_checksum};
	int data =  USART_ReceiveData(USART2);
	Gv_UART_Timeout = 500;
	//pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;

	if (data & 0x80){
		// Command
		if(data == (0x80U | ((controller_address & 0x0fU)<<3U))){
			data = (curr_status<<6)|curr_time;
			USART_SendData(USART2,data);
		}
		else if (data == (0x80U | ((controller_address & 0x0fU)<<3U) | 1U)) //Command 1 - Start
		{
			pre_time = 0;
			update_status();
		}
		else if (data == (0x80U | ((controller_address & 0x0fU)<<3U) | 2U)) //Command 2 == Pre_time_set
		{
			rx_state = state_pre_time;
		}
		else if (data == (0x80U | ((controller_address & 0x0fU)<<3U) | 5U)) //Command 5 == Main_time_set
		{
			rx_state = state_main_time;
		}
		else if (data == (0x80U | ((controller_address & 0x0fU)<<3U) | 3U)) //Command 3 == Cool_time_set
		{
			rx_state = state_cool_time;
		}

	} else if (rx_state){
		// payload
		int time_in_hex = ToBCD(main_time_sent);
		if(rx_state == state_get_checksum){
			unsigned char checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			if(	data == checksum){
				pre_time = pre_time_sent;
				main_time = main_time_sent;
				cool_time = cool_time_sent;
				update_status();
				Gv_miliseconds = 0;
			}
			rx_state = 0;
		}
		if(rx_state == state_pre_time){
			pre_time_sent = data;
			rx_state = 0;
		}
		if(rx_state == state_main_time){
			main_time_sent = data;
			rx_state = 0;
		}
		if(rx_state == state_cool_time){
			cool_time_sent = data;
			rx_state = state_get_checksum;
			unsigned char checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			data = checksum;
			USART_SendData(USART2,data);
		}


	}
//	USART_SendData(USART2,0x80);
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
